zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC54605J512BD100-pinctrl.h
#define DMA0_TRIG14_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG15_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG16_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG17_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG18_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG19_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG1_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG20_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG21_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG22_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG23_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG24_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG25_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG26_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG27_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG28_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG29_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG2_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG3_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG4_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG5_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG6_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG7_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG8_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG9_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define EMC_EMC_A11_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 6) /* PIO1_23 */
#define FC2_SCK_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 1) /* PIO1_23 */
#define FC3_SSEL2_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 5) /* PIO1_23 */
#define GPIO_PIO123_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT0_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT1_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT2_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT3_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT4_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT5_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT6_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT7_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define SCT0_OUT0_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 2) /* PIO1_23 */
#define ADC0_TRIG1_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define ADC0_TRIG2_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG0_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG10_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG11_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG12_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG13_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG14_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG15_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG16_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG17_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG18_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG19_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG1_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG20_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG21_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG22_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG23_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG24_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG25_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG26_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG27_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG28_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG29_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG2_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG3_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG4_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG5_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG6_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG7_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG8_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG9_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define EMC_EMC_A12_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 6) /* PIO1_24 */
#define FC2_RXD_SDA_MOSI_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 1) /* PIO1_24 */
#define FC3_SSEL3_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 5) /* PIO1_24 */
#define GPIO_PIO124_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT0_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT1_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT2_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT3_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT4_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT5_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT6_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT7_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define SCT0_OUT1_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 2) /* PIO1_24 */
#define ADC0_TRIG1_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define ADC0_TRIG2_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG0_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG10_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG11_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG12_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG13_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG14_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG15_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG16_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG17_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG18_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG19_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG1_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG20_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG21_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG22_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG23_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG24_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG25_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG26_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG27_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG28_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG29_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG2_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG3_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG4_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG5_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG6_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG7_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG8_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG9_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define EMC_EMC_A13_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 6) /* PIO1_25 */
#define FC2_TXD_SCL_MISO_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 1) /* PIO1_25 */
#define GPIO_PIO125_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT0_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT1_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT2_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT3_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT4_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT5_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT6_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT7_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define SCT0_OUT2_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 2) /* PIO1_25 */
#define UTICK0_CAPTURE0_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 4) /* PIO1_25 */
#define ADC0_TRIG1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define ADC0_TRIG2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define CTIMER0_CAPTURE3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define DMA0_TRIG0_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG10_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG11_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG12_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG13_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG14_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG15_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG16_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG17_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG18_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG19_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG20_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG21_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG22_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG23_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG24_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG25_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG26_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG27_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG28_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG29_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG4_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG5_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG6_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG7_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG8_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG9_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define EMC_EMC_A8_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 6) /* PIO1_26 */
#define FC2_CTS_SDA_SSEL0_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 1) /* PIO1_26 */
#define GPIO_PIO126_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT_PINT0_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT_PINT1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT_PINT2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT_PINT3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT_PINT4_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT_PINT5_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT_PINT6_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT_PINT7_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define SCT0_OUT3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 2) /* PIO1_26 */
#define UTICK0_CAPTURE1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 4) /* PIO1_26 */
#define ADC0_TRIG1_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define ADC0_TRIG2_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define CLKOUT_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 4) /* PIO1_27 */
#define CTIMER0_MATCH3_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 3) /* PIO1_27 */
#define DMA0_TRIG0_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG10_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG11_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG12_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG13_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG14_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG15_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG16_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG17_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG18_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG19_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG1_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG20_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG21_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG22_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG23_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG24_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG25_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG26_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG27_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG28_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG29_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG2_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG3_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG4_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG5_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG6_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG7_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG8_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA0_TRIG9_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define EMC_EMC_A9_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 6) /* PIO1_27 */
#define FC2_RTS_SCL_SSEL1_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 1) /* PIO1_27 */
#define GPIO_PIO127_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT_PINT0_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT_PINT1_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT_PINT2_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT_PINT3_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT_PINT4_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT_PINT5_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT_PINT6_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT_PINT7_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 0) /* PIO1_27 */
#define SDIF_SD_D4_PIO1_27 IOCON_MUX(59, IOCON_TYPE_D, 2) /* PIO1_27 */
#define ADC0_TRIG1_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define ADC0_TRIG2_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER0_CAPTURE2_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 3) /* PIO1_28 */
#define DMA0_TRIG0_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG10_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG11_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG12_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG13_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG14_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG15_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG16_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG17_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG18_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG19_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG1_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG20_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG21_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG22_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG23_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG24_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG25_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG26_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG27_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG28_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG29_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG2_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG3_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG4_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG5_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG6_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG7_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG8_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA0_TRIG9_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define EMC_EMC_D12_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 6) /* PIO1_28 */
#define FC7_SCK_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 1) /* PIO1_28 */
#define GPIO_PIO128_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT_PINT0_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT_PINT1_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT_PINT2_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT_PINT3_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT_PINT4_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT_PINT5_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT_PINT6_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT_PINT7_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 0) /* PIO1_28 */
#define SDIF_SD_D5_PIO1_28 IOCON_MUX(60, IOCON_TYPE_D, 2) /* PIO1_28 */
#define ADC0_TRIG1_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define ADC0_TRIG2_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG0_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG10_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG11_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG12_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG13_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG14_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG15_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG16_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG17_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG18_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG19_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG1_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG20_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG21_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG22_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG23_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG24_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG25_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG26_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG27_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG28_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG29_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG2_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG3_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG4_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG5_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG6_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG7_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG8_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA0_TRIG9_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define EMC_EMC_D13_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 6) /* PIO1_29 */
#define FC7_RXD_SDA_MOSI_DATA_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 1) /* PIO1_29 */
#define GPIO_PIO129_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT0_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT1_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT2_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT3_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT4_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT5_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT6_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT7_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define SCT0_IN0_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN1_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN2_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN3_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN4_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN5_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN6_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SDIF_SD_D6_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 2) /* PIO1_29 */
#define USB1_FRAME_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 5) /* PIO1_29 */
#define USB1_PORTPWRN_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 4) /* PIO1_29 */
#define ADC0_TRIG1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define ADC0_TRIG2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG10_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG11_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG12_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG13_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG14_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG15_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG16_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG17_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG18_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
